Script started on Sun 09 Feb 2014 04:52:55 PM PST
[?1034hbash-1$ gdb uninit
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/uninit...done.
(gdb) run
Starting program: /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/uninit 
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

0
1
[Inferior 1 (process 10981) exited normally]
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.5.x86_64
(gdb) where
No stack.
(gdb) list
1	// $Id: uninit.c,v 1.1 2014-02-09 16:49:34-08 - - $
2	
3	#include <stdio.h>
4	#include <stdlib.h>
5	
6	int main (int argc, char **argv) {
7	   int foo;
8	   printf ("%d\n", foo);
9	   int *pointer;
10	   printf ("%d\n", *pointer);
(gdb) print foo
No symbol "foo" in current context.
(gdb) print pointer
No symbol "pointer" in current context.
(gdb) print pointer*pointer
No symbol "pointer" in current context.
(gdb) print argv[0]
No symbol "argv" in current context.
(gdb) quit
bash-2$ exit
exit

Script done on Sun 09 Feb 2014 04:55:24 PM PST
