Script started on Sun 09 Feb 2014 05:40:44 PM PST
[?1034hbash-1$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005bf: file list2.c, line 15.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=3, argv=0x7fffffffde58) at list2.c:15
15	   for (int argi = 0; argi < argc; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.5.x86_64
(gdb) print arc[Kd[Kgc
$1 = 3
(gdb) print argc[Kv
$2 = (char **) 0x7fffffffde58
(gdb) print argv[0]
$3 = 0x7fffffffe140 "/afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2"
(gdb) print argv[0][1P]1]
$4 = 0x7fffffffe180 "foo"
(gdb) print argv[1][1P]2]
$5 = 0x7fffffffe184 "bar"
(gdb) print argv[2][1P]3]
$6 = 0x0
(gdb) print argv[3][1P]4]
$7 = 0x7fffffffe188 "MANWIDTH=72"
(gdb) print argv[4][1P]5]
$8 = 0x7fffffffe194 "MANPATH=/opt/rh/devtoolset-2/root/usr/share/man:"
(gdb) print argv[5][1P]6]
$9 = 0x7fffffffe1c5 "HOSTNAME=unix2.lt.ucsc.edu"
(gdb) quit
A debugging session is active.

	Inferior 1 [process 17211] will be killed.

Quit anyway? (y or n) y
bash-2$ exit
exit

Script done on Sun 09 Feb 2014 05:43:10 PM PST
