Script started on Sun 09 Feb 2014 05:07:01 PM PST
[?1034hbash-1$ mk list1.c
CSOURCE=list1.c EXECBIN=list1
+ cid + list1.c
+ checksource list1.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list1.c -o list1 -lm
list1.c: In function â€˜mainâ€™:
list1.c:15:7: warning: implicit declaration of function â€˜mallocâ€™ [-Wimplicit-function-declaration]
       node *node = malloc (sizeof (struct node));
       ^
list1.c:15:20: warning: incompatible implicit declaration of built-in function â€˜mallocâ€™ [enabled by default]
       node *node = malloc (sizeof (struct node));
                    ^
list1.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
bash-2$ man malloc
MALLOC(3)                  Linux Programmerâ€™s Manual                 MALLOC(3)



NNAAMMEE
       calloc, malloc, free, realloc - Allocate and free dynamic
       memory

SSYYNNOOPPSSIISS
       ##iinncclluuddee <<ssttddlliibb..hh>>

       vvooiidd **ccaalllloocc((ssiizzee[4m_[24mtt [4mnmemb[24m,, ssiizzee[4m_[24mtt [4msize[24m));;
       vvooiidd **mmaalllloocc((ssiizzee[4m_[24mtt [4msize[24m));;
       vvooiidd ffrreeee((vvooiidd [4m*ptr[24m));;
       vvooiidd **rreeaalllloocc((vvooiidd [4m*ptr[24m,, ssiizzee[4m_[24mtt [4msize[24m));;

DDEESSCCRRIIPPTTIIOONN
       ccaalllloocc() allocates memory for an array of [4mnmemb[24m  elements
       of [4msize[24m bytes each and returns a pointer to the allocated
       memory.  The memory is set to zero.  If [4mnmemb[24m or [4msize[24m  is
       0, then ccaalllloocc() returns either NULL, or a unique pointer
       value that can later be successfully passed to ffrreeee().

       mmaalllloocc() allocates [4msize[24m bytes and returns  a  pointer  to
       the  allocated  memory.   The  memory is not cleared.  If
       [4msize[24m is 0, then mmaalllloocc() returns either NULL, or a unique
       pointer  value  that  can later be successfully passed to
       ffrreeee().

       ffrreeee() frees the memory space pointed to  by  [4mptr[24m,  which
       must  have  been returned by a previous call to mmaalllloocc(),
       ccaalllloocc() or rreeaalllloocc().  Otherwise, or  if  [4mfree(ptr)[24m  has
       already  been  called  before, undefined behavior occurs.
       If [4mptr[24m is NULL, no operation is performed.

       rreeaalllloocc() changes the size of the memory block pointed to
       by  [4mptr[24m to [4msize[24m bytes.  The contents will be unchanged to
       the minimum of the old and  new  sizes;  newly  allocated
       memory  will  be uninitialized.  If [4mptr[24m is NULL, then the
       call is equivalent to [4mmalloc(size)[24m,  for  all  values  of
       [4msize[24m; if [4msize[24m is equal to zero, and [4mptr[24m is not NULL, then
       the call is equivalent to [4mfree(ptr)[24m.  Unless [4mptr[24m is NULL,
       it  must  have  been  returned by an earlier call to mmaall--
       lloocc(), ccaalllloocc() or rreeaalllloocc().  If the area pointed to was
       moved, a [4mfree(ptr)[24m is done.

RREETTUURRNN VVAALLUUEE
       For  ccaalllloocc() and mmaalllloocc(), return a pointer to the allo-
       cated memory, which is suitably aligned for any  kind  of
       variable.   On  error, these functions return NULL.  NULL
       may also be returned by a  successful  call  to  mmaalllloocc()
       with  a [4msize[24m of zero, or by a successful call to ccaalllloocc()
[7m--More--[27m
[1]+  Stopped                 man malloc
bash-3$ exit
exit
There are stopped jobs.
bash-4$ cp lai[K[Kist1.c list2.c
bash-5$ emacs list3[K2.c
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;124m// $Id: list1.c,v 1.1 2014-02-09 17:07:12-08 - - $                                        [39;49m
[A
[K
[38;5;170m#include[39;49m [38;5;138m<assert.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[K
[38;5;129mtypedef[39;49m [38;5;129mstruct[39;49m [38;5;28mnode[39;49m [38;5;28mnode[39;49m;[K
[38;5;129mstruct[39;49m [38;5;28mnode[39;49m {[K
   [38;5;28mchar[39;49m *[38;5;136mword[39;49m;[K
   [38;5;28mnode[39;49m *[38;5;136mlink[39;49m;[K
};[K
[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m ([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m **[38;5;136margv[39;49m) {[K
   [38;5;28mnode[39;49m *[38;5;136mhead[39;49m;[K
   [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;136margi[39;49m = 0; argi < 5; ++argi) {[K
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[K
      assert (node != [38;5;73mNULL[39;49m);[K
      node->word = argv[argi];[K
      node->link = head;[K
      head = node;[K
   }[K
   [38;5;129mfor[39;49m (node *curr = head; curr->link != [38;5;73mNULL[39;49m; curr = curr->link) {[K
      printf ([38;5;138m"%p->node {word=%p->[%s], link=%p}\n"[39;49m,[K
              curr, curr->word, curr->word, curr->link);[K
   }[K
   [38;5;129mreturn[39;49m 9;[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L1     (C/l Abbrev)---------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[53d[K[?1l>[?12l[?25h[?1049l[39;49m
[2]+  Stopped                 emacs list2.c
bash-6$ man malloc 3
MALLOC(3)                  Linux Programmerâ€™s Manual                 MALLOC(3)



NNAAMMEE
       calloc, malloc, free, realloc - Allocate and free dynamic
       memory

SSYYNNOOPPSSIISS
       ##iinncclluuddee <<ssttddlliibb..hh>>

       vvooiidd **ccaalllloocc((ssiizzee[4m_[24mtt [4mnmemb[24m,, ssiizzee[4m_[24mtt [4msize[24m));;
       vvooiidd **mmaalllloocc((ssiizzee[4m_[24mtt [4msize[24m));;
       vvooiidd ffrreeee((vvooiidd [4m*ptr[24m));;
       vvooiidd **rreeaalllloocc((vvooiidd [4m*ptr[24m,, ssiizzee[4m_[24mtt [4msize[24m));;

DDEESSCCRRIIPPTTIIOONN
       ccaalllloocc() allocates memory for an array of [4mnmemb[24m  elements
       of [4msize[24m bytes each and returns a pointer to the allocated
       memory.  The memory is set to zero.  If [4mnmemb[24m or [4msize[24m  is
       0, then ccaalllloocc() returns either NULL, or a unique pointer
       value that can later be successfully passed to ffrreeee().

       mmaalllloocc() allocates [4msize[24m bytes and returns  a  pointer  to
       the  allocated  memory.   The  memory is not cleared.  If
       [4msize[24m is 0, then mmaalllloocc() returns either NULL, or a unique
       pointer  value  that  can later be successfully passed to
       ffrreeee().

       ffrreeee() frees the memory space pointed to  by  [4mptr[24m,  which
       must  have  been returned by a previous call to mmaalllloocc(),
       ccaalllloocc() or rreeaalllloocc().  Otherwise, or  if  [4mfree(ptr)[24m  has
       already  been  called  before, undefined behavior occurs.
       If [4mptr[24m is NULL, no operation is performed.

       rreeaalllloocc() changes the size of the memory block pointed to
       by  [4mptr[24m to [4msize[24m bytes.  The contents will be unchanged to
       the minimum of the old and  new  sizes;  newly  allocated
       memory  will  be uninitialized.  If [4mptr[24m is NULL, then the
       call is equivalent to [4mmalloc(size)[24m,  for  all  values  of
       [4msize[24m; if [4msize[24m is equal to zero, and [4mptr[24m is not NULL, then
       the call is equivalent to [4mfree(ptr)[24m.  Unless [4mptr[24m is NULL,
       it  must  have  been  returned by an earlier call to mmaall--
       lloocc(), ccaalllloocc() or rreeaalllloocc().  If the area pointed to was
       moved, a [4mfree(ptr)[24m is done.

RREETTUURRNN VVAALLUUEE
       For  ccaalllloocc() and mmaalllloocc(), return a pointer to the allo-
       cated memory, which is suitably aligned for any  kind  of
       variable.   On  error, these functions return NULL.  NULL
       may also be returned by a  successful  call  to  mmaalllloocc()
       with  a [4msize[24m of zero, or by a successful call to ccaalllloocc()
[7m--More--[27m
[3]+  Stopped                 man malloc 3
bash-7$ emacs[K[K[Kacs list2.c
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;124m// $Id: list1.c,v 1.1 2014-02-09 17:07:12-08 - - $                                        [39;49m
[A
[K
[38;5;170m#include[39;49m [38;5;138m<assert.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[K
[38;5;129mtypedef[39;49m [38;5;129mstruct[39;49m [38;5;28mnode[39;49m [38;5;28mnode[39;49m;[K
[38;5;129mstruct[39;49m [38;5;28mnode[39;49m {[K
   [38;5;28mchar[39;49m *[38;5;136mword[39;49m;[K
   [38;5;28mnode[39;49m *[38;5;136mlink[39;49m;[K
};[K
[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m ([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m **[38;5;136margv[39;49m) {[K
   [38;5;28mnode[39;49m *[38;5;136mhead[39;49m;[K
   [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;136margi[39;49m = 0; argi < 5; ++argi) {[K
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[K
      assert (node != [38;5;73mNULL[39;49m);[K
      node->word = argv[argi];[K
      node->link = head;[K
      head = node;[K
   }[K
   [38;5;129mfor[39;49m (node *curr = head; curr->link != [38;5;73mNULL[39;49m; curr = curr->link) {[K
      printf ([38;5;138m"%p->node {word=%p->[%s], link=%p}\n"[39;49m,[K
              curr, curr->word, curr->word, curr->link);[K
   }[K
   [38;5;129mreturn[39;49m 9;[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L1     (C/l Abbrev)---------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[52;34H[?25l[30m[48;5;250m4[39;49m[5;13H[?12l[?25h[?12;25h[C[C		[C[C[1;28r[7;1H[1L[1;53r[7;1H[K[52;6H[?25l[30m[48;5;250m**--F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L5[39;49m[6;1H[?12l[?25h[?12;25h[?25l#[?12l[?25h[?12;25h[?25l[38;5;170m#i[39;49m[?12l[?25h[?12;25h[?25l[38;5;170mn[39;49m[?12l[?25h[?12;25h[?25l[38;5;170mc[39;49m[?12l[?25h[?12;25h[?25l[38;5;170ml[39;49m[?12l[?25h[?12;25h[?25l[38;5;170mu[39;49m[?12l[?25h[?12;25h[?25l[38;5;170md[39;49m[?12l[?25h[?12;25h[?25l[38;5;170me[39;49m[?12l[?25h[?12;25h[C[?25l[38;5;138m<[39;49m[?12l[?25h[?12;25h[?25l[38;5;138ms[39;49m[?12l[?25h[?12;25h[?25l[38;5;138mt[39;49m[?12l[?25h[?12;25h[?25l[38;5;138md[39;49m[?12l[?25h[?12;25h[?25l[38;5;138ml[39;49m[?12l[?25h[?12;25h[?25l[38;5;138mi[39;49m[?12l[?25h[?12;25h[?25l[38;5;138mb[39;49m[?12l[?25h[?12;25h[?25l[38;5;138m.[39;49m[?12l[?25h[?12;25h[?25l[38;5;138mh[39;49m[?12l[?25h[?12;25h[?25l[38;5;138m>[39;49m[?12l[?25h[?12;25h[53;1H[?25lSaving file /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2.c...[6;20H[?12l[?25h[?12;25h[53;1H[?25lWrote /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2.c[K[6;20H[?12l[?25h[?12;25h[52;6H[?25l[30m[48;5;250m--[39;49m[6;20H[?12l[?25h[?12;25h[53;1H[K[?1l>[?12l[?25h[?1049l[39;49m
[4]+  Stopped                 emacs list2.c
bash-8$ ls
list1	 list2.c~  mk		      part03.typescript  RCS
list1.c  malloc    part01.typescript  part04.typescript  uninit
list2.c  malloc.c  part02.typescript  part05.typescript  uninit.c
bash-9$ lsemacs list2.c[C[C[C[C[C[C[C[C[1Pman malloc 3[C[C[C[C[C[C[C[Cemacs list2.c[C[C[C[C[C[C[C[C[5@cp list1.c[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[Cexit[Kman mallock list1.can malloc[C[C[C[C[C[C[C[C[6Pexitcp list1.c list2.c[C[C[C[C[C[C[C[C[5Pemacs[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[1Pman malloc 3[C[C[C[C[C[C[C[Cemacs list2.c[C[C[C[C[C[C[C[Cls[K[Kscript part06.typescript
Script started, file is part06.typescript
[?1034hbash-1$ mk list2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
list2.c: In function â€˜mainâ€™:
list2.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
bash-2$ mk[K[Kc[Kvalgrind list2 foo bar
==13398== Memcheck, a memory error detector
==13398== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==13398== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==13398== Command: list2 foo bar
==13398== 
0x4c28180->node {word=0x7ff00010d->[MANWIDTH=72], link=0x4c28130}
0x4c28130->node {word=(nil)->[(null)], link=0x4c280e0}
0x4c280e0->node {word=0x7ff000109->[bar], link=0x4c28090}
0x4c28090->node {word=0x7ff000105->[foo], link=0x4c28040}
==13398== Conditional jump or move depends on uninitialised value(s)
==13398==    at 0x400682: main (list2.c:22)
==13398== 
==13398== 
==13398== HEAP SUMMARY:
==13398==     in use at exit: 80 bytes in 5 blocks
==13398==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==13398== 
==13398== LEAK SUMMARY:
==13398==    definitely lost: 16 bytes in 1 blocks
==13398==    indirectly lost: 64 bytes in 4 blocks
==13398==      possibly lost: 0 bytes in 0 blocks
==13398==    still reachable: 0 bytes in 0 blocks
==13398==         suppressed: 0 bytes in 0 blocks
==13398== Rerun with --leak-check=full to see details of leaked memory
==13398== 
==13398== For counts of detected and suppressed errors, rerun with: -v
==13398== Use --track-origins=yes to see where uninitialised values come from
==13398== ERROR SUMMARY: 1 errors from 1 contexts (suppressed: 6 from 6)
bash-3$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2...done.
(gdb) run foo v[Kbar
Starting program: /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

0x601090->node {word=0x7fffffffe188->[MANWIDTH=72], link=0x601070}
0x601070->node {word=(nil)->[(null)], link=0x601050}
0x601050->node {word=0x7fffffffe184->[bar], link=0x601030}
0x601030->node {word=0x7fffffffe180->[foo], link=0x601010}
[Inferior 1 (process 13537) exited with code 011]
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.5.x86_64
(gdb) where
No stack.
(gdb) list
6	
7	typedef struct node node;
8	struct node {
9	   char *word;
10	   node *link;
11	};
12	
13	int main (int argc, char **argv) {
14	   node *head;
15	   for (int argi = 0; argi < 5; ++argi) {
(gdb) list list2.c:23
18	      node->word = argv[argi];
19	      node->link = head;
20	      head = node;
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) print head
No symbol "head" in current context.
(gdb) bt
No stack.
(gdb) up
No stack.
(gdb) up
No stack.
(gdb) up
No stack.
(gdb) print head
No symbol "head" in current context.
(gdb) print *head
No symbol "head" in current context.
(gdb) print *(head->word)
No symbol "head" in current context.
(gdb) quit
bash-4$ exit
exit
Script done, file is part06.typescript
bash-10$ rm[K[Kscript part06.typescript[1P part06.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[C[1P part06.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[1P part06.typescript[C[C[C[C[C[C[C[C[C[C[C[C[1P part06.typescript[C[C[C[C[C[C[C[C[C[C[C[1P part06.typescript[C[C[C[C[C[C[C[C[C[C[1P part06.typescript[C[C[C[C[C[C[C[C[Cr part06.typescript[C[C[C[C[C[C[C[C[C[Cm part06.typescript[C[C[C[C[C[C[C[C[C[C[C
rm: remove regular file `part06.typescript'? yes
bash-11$ mk li[K[K[K[K[Krm part06.typescript[C[C[C[C[C[C[C[C[C[4@script[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[4Prm[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[4@script[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Script started, file is part06.typescript
[?1034hbash-1$ mkm[K list2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
list2.c: In function â€˜mainâ€™:
list2.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
bash-2$ mk list2.c[K[K[K[K[K[K[K[K[K[Kvalgrind lia[Ksy[Kt 2[K2[K[K2 foo bar
==13720== Memcheck, a memory error detector
==13720== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==13720== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==13720== Command: list2 foo bar
==13720== 
0x4c28180->node {word=0x7ff00010d->[MANWIDTH=72], link=0x4c28130}
0x4c28130->node {word=(nil)->[(null)], link=0x4c280e0}
0x4c280e0->node {word=0x7ff000109->[bar], link=0x4c28090}
0x4c28090->node {word=0x7ff000105->[foo], link=0x4c28040}
==13720== Conditional jump or move depends on uninitialised value(s)
==13720==    at 0x400682: main (list2.c:22)
==13720== 
==13720== 
==13720== HEAP SUMMARY:
==13720==     in use at exit: 80 bytes in 5 blocks
==13720==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==13720== 
==13720== LEAK SUMMARY:
==13720==    definitely lost: 16 bytes in 1 blocks
==13720==    indirectly lost: 64 bytes in 4 blocks
==13720==      possibly lost: 0 bytes in 0 blocks
==13720==    still reachable: 0 bytes in 0 blocks
==13720==         suppressed: 0 bytes in 0 blocks
==13720== Rerun with --leak-check=full to see details of leaked memory
==13720== 
==13720== For counts of detected and suppressed errors, rerun with: -v
==13720== Use --track-origins=yes to see where uninitialised values come from
==13720== ERROR SUMMARY: 1 errors from 1 contexts (suppressed: 6 from 6)
bash-3$ run[K[K[Kgdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2...done.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

0x601090->node {word=0x7fffffffe188->[MANWIDTH=72], link=0x601070}
0x601070->node {word=(nil)->[(null)], link=0x601050}
0x601050->node {word=0x7fffffffe184->[bar], link=0x601030}
0x601030->node {word=0x7fffffffe180->[foo], link=0x601010}
[Inferior 1 (process 13824) exited with code 011]
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.5.x86_64
(gdb) where
No stack.
(gdb) list
6	
7	typedef struct node node;
8	struct node {
9	   char *word;
10	   node *link;
11	};
12	
13	int main (int argc, char **argv) {
14	   node *head;
15	   for (int argi = 0; argi < 5; ++argi) {
(gdb) list list2.c:23
18	      node->word = argv[argi];
19	      node->link = head;
20	      head = node;
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) print head
No symbol "head" in current context.
(gdb) bt
No stack.
(gdb) up
No stack.
(gdb) up
No stack.
(gdb) up
No stack.
(gdb) print head
No symbol "head" in current context.
(gdb) print *head
No symbol "head" in current context.
(gdb) print head [K->link->link->link
No symbol "head" in current context.
(gdb) print head->link->link->link(head->link->link->link[C[C[C[C[C[C[C[C[C[C[C[C[C*(head->link->link->link[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C)
No symbol "head" in current context.
(gdb) quit
bash-4$ exit
exit
Script done, file is part06.typescript
bash-12$ mk list2
./mk: list2: is not a C source file
bash-13$ mk list2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
list2.c: In function â€˜mainâ€™:
list2.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
bash-14$ cat[K[K[Kemacs list.[K2.c
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;124m// $Id: list2.c,v 1.1 2014-02-09 17:10:42-08 - - $                                        [39;49m
[A
[K
[38;5;170m#include[39;49m [38;5;138m<assert.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdlib.h>[39;49m[K
[K
[38;5;129mtypedef[39;49m [38;5;129mstruct[39;49m [38;5;28mnode[39;49m [38;5;28mnode[39;49m;[K
[38;5;129mstruct[39;49m [38;5;28mnode[39;49m {[K
   [38;5;28mchar[39;49m *[38;5;136mword[39;49m;[K
   [38;5;28mnode[39;49m *[38;5;136mlink[39;49m;[K
};[K
[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m ([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m **[38;5;136margv[39;49m) {[K
   [38;5;28mnode[39;49m *[38;5;136mhead[39;49m;[K
   [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;136margi[39;49m = 0; argi < 5; ++argi) {[K
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[K
      assert (node != [38;5;73mNULL[39;49m);[K
      node->word = argv[argi];[K
      node->link = head;[K
      head = node;[K
   }[K
   [38;5;129mfor[39;49m (node *curr = head; curr->link != [38;5;73mNULL[39;49m; curr = curr->link) {[K
      printf ([38;5;138m"%p->node {word=%p->[%s], link=%p}\n"[39;49m,[K
              curr, curr->word, curr->word, curr->link);[K
   }[K
   [38;5;129mreturn[39;49m 9;[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L1    RCS-1.1  (C/l Abbrev)-------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m8[39;49m[9;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m9[39;49m[10;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m10[39;49m[11;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m3[39;49m[14;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m4[39;49m[15;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m5[39;49m[16;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m7[39;49m[18;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m5[39;49m[16;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C[?25l[1P[52;6H[30m[48;5;250m**[39;49m[16;30H[?12l[?25h[?12;25h[?25l[1@a[?12l[?25h[?12;25h[?25l[1@g[?12l[?25h[?12;25h[?25l[1@r[?12l[?25h[?12;25h[?25l[1@c[?12l[?25h[?12;25h[53;1H[?25lSaving file /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2.c...[16;34H[?12l[?25h[?12;25h[53;1H[?25lWrote /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2.c[K[16;34H[?12l[?25h[?12;25h[52;6H[?25l[30m[48;5;250m----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L15   RCS:[39;49m[16;34H[?12l[?25h[?12;25h[53;1H[K[?1l>[?12l[?25h[?1049l[39;49m
[5]+  Stopped                 emacs list2.c
bash-15$ mk list2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
list2.c: In function â€˜mainâ€™:
list2.c:15:30: error: â€˜agrcâ€™ undeclared (first use in this function)
    for (int argi = 0; argi < agrc; ++argi) {
                              ^
list2.c:15:30: note: each undeclared identifier is reported only once for each function it appears in
list2.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
bash-16$ emacs list3[K2.c
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;124m// $Id: list2.c,v 1.2 2014-02-09 17:19:55-08 - - $                                        [39;49m
[A
[K
[38;5;170m#include[39;49m [38;5;138m<assert.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdlib.h>[39;49m[K
[K
[38;5;129mtypedef[39;49m [38;5;129mstruct[39;49m [38;5;28mnode[39;49m [38;5;28mnode[39;49m;[K
[38;5;129mstruct[39;49m [38;5;28mnode[39;49m {[K
   [38;5;28mchar[39;49m *[38;5;136mword[39;49m;[K
   [38;5;28mnode[39;49m *[38;5;136mlink[39;49m;[K
};[K
[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m ([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m **[38;5;136margv[39;49m) {[K
   [38;5;28mnode[39;49m *[38;5;136mhead[39;49m;[K
   [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;136margi[39;49m = 0; argi < agrc; ++argi) {[K
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[K
      assert (node != [38;5;73mNULL[39;49m);[K
      node->word = argv[argi];[K
      node->link = head;[K
      head = node;[K
   }[K
   [38;5;129mfor[39;49m (node *curr = head; curr->link != [38;5;73mNULL[39;49m; curr = curr->link) {[K
      printf ([38;5;138m"%p->node {word=%p->[%s], link=%p}\n"[39;49m,[K
              curr, curr->word, curr->word, curr->link);[K
   }[K
   [38;5;129mreturn[39;49m 9;[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L1    RCS-1.2  (C/l Abbrev)-------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m8[39;49m[9;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m9[39;49m[10;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m10[39;49m[11;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m3[39;49m[14;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m4[39;49m[15;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m5[39;49m[16;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m7[39;49m[18;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C	[52;35H[?25l[30m[48;5;250m5[39;49m[16;32H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m4[39;49m[15;15H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m5[39;49m[16;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[C[52;35H[?25l[30m[48;5;250m5[39;49m[16;2H[?12l[?25h[?12;25h[C[C[16;6H[C		[C[C[C[C[16;27H[C[C[C[C		[C[?25l[1P[52;6H[30m[48;5;250m**[39;49m[16;33H[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1@3[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1@5[?12l[?25h[?12;25h[53;1H[?25lSaving file /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2.c...[16;31H[?12l[?25h[?12;25h[53;1H[?25lWrote /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2.c[K[16;31H[?12l[?25h[?12;25h[52;6H[?25l[30m[48;5;250m----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L15   RCS:[39;49m[16;31H[?12l[?25h[?12;25h[53;1H[K[?1l>[?12l[?25h[?1049l[39;49m
[6]+  Stopped                 emacs list2.c
bash-17$ emacs list2.c[C[C[C[C[C[C[C[C[C[3Pmk[C[C[C[C[C[C[C[C
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
list2.c: In function â€˜mainâ€™:
list2.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
bash-18$ emacs [K[K[K[K[K[Kmk list2.c[3@emacs[C[C[C[C[C[C[C[C
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;124m// $Id: list2.c,v 1.3 2014-02-09 17:20:35-08 - - $                                        [39;49m
[A
[K
[38;5;170m#include[39;49m [38;5;138m<assert.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdlib.h>[39;49m[K
[K
[38;5;129mtypedef[39;49m [38;5;129mstruct[39;49m [38;5;28mnode[39;49m [38;5;28mnode[39;49m;[K
[38;5;129mstruct[39;49m [38;5;28mnode[39;49m {[K
   [38;5;28mchar[39;49m *[38;5;136mword[39;49m;[K
   [38;5;28mnode[39;49m *[38;5;136mlink[39;49m;[K
};[K
[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m ([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m **[38;5;136margv[39;49m) {[K
   [38;5;28mnode[39;49m *[38;5;136mhead[39;49m;[K
   [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;136margi[39;49m = 0; argi < 5; ++argi) {[K
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[K
      assert (node != [38;5;73mNULL[39;49m);[K
      node->word = argv[argi];[K
      node->link = head;[K
      head = node;[K
   }[K
   [38;5;129mfor[39;49m (node *curr = head; curr->link != [38;5;73mNULL[39;49m; curr = curr->link) {[K
      printf ([38;5;138m"%p->node {word=%p->[%s], link=%p}\n"[39;49m,[K
              curr, curr->word, curr->word, curr->link);[K
   }[K
   [38;5;129mreturn[39;49m 9;[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L1    RCS-1.3  (C/l Abbrev)-------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lBeginning of buffer[K[H
[?12l[?25h[?12;25h[53d[K[?1l>[?12l[?25h[?1049l[39;49m
[7]+  Stopped                 emacs list2.c
bash-19$ emacs list2.c[1P.c1.c
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;124m// $Id: list1.c,v 1.1 2014-02-09 17:07:12-08 - - $                                        [39;49m
[A
[K
[38;5;170m#include[39;49m [38;5;138m<assert.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[K
[38;5;129mtypedef[39;49m [38;5;129mstruct[39;49m [38;5;28mnode[39;49m [38;5;28mnode[39;49m;[K
[38;5;129mstruct[39;49m [38;5;28mnode[39;49m {[K
   [38;5;28mchar[39;49m *[38;5;136mword[39;49m;[K
   [38;5;28mnode[39;49m *[38;5;136mlink[39;49m;[K
};[K
[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m ([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m **[38;5;136margv[39;49m) {[K
   [38;5;28mnode[39;49m *[38;5;136mhead[39;49m;[K
   [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;136margi[39;49m = 0; argi < 5; ++argi) {[K
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[K
      assert (node != [38;5;73mNULL[39;49m);[K
      node->word = argv[argi];[K
      node->link = head;[K
      head = node;[K
   }[K
   [38;5;129mfor[39;49m (node *curr = head; curr->link != [38;5;73mNULL[39;49m; curr = curr->link) {[K
      printf ([38;5;138m"%p->node {word=%p->[%s], link=%p}\n"[39;49m,[K
              curr, curr->word, curr->word, curr->link);[K
   }[K
   [38;5;129mreturn[39;49m 9;[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mlist1.c     [0m[39;49m[30m[48;5;250m   All L1    RCS-1.1  (C/l Abbrev)-------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[?1l>[?12l[?25h[?1049l[39;49m
[8]+  Stopped                 emacs list1.c
bash-20$ emacs list1.c[C[C[C[C[C[C[C[C[C[Kemacs list1.c2.c[C[C[C[C[C[C[C[C[C[3Pmk[C[C[C[C[C[C[C[C[1P.c1.c
CSOURCE=list1.c EXECBIN=list1
+ cid + list1.c
+ checksource list1.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list1.c -o list1 -lm
list1.c: In function â€˜mainâ€™:
list1.c:15:7: warning: implicit declaration of function â€˜mallocâ€™ [-Wimplicit-function-declaration]
       node *node = malloc (sizeof (struct node));
       ^
list1.c:15:20: warning: incompatible implicit declaration of built-in function â€˜mallocâ€™ [enabled by default]
       node *node = malloc (sizeof (struct node));
                    ^
list1.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
bash-21$ em\\[K[Kacs list2.c
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;124m// $Id: list2.c,v 1.3 2014-02-09 17:20:35-08 - - $                                        [39;49m
[A
[K
[38;5;170m#include[39;49m [38;5;138m<assert.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdlib.h>[39;49m[K
[K
[38;5;129mtypedef[39;49m [38;5;129mstruct[39;49m [38;5;28mnode[39;49m [38;5;28mnode[39;49m;[K
[38;5;129mstruct[39;49m [38;5;28mnode[39;49m {[K
   [38;5;28mchar[39;49m *[38;5;136mword[39;49m;[K
   [38;5;28mnode[39;49m *[38;5;136mlink[39;49m;[K
};[K
[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m ([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m **[38;5;136margv[39;49m) {[K
   [38;5;28mnode[39;49m *[38;5;136mhead[39;49m;[K
   [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;136margi[39;49m = 0; argi < 5; ++argi) {[K
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[K
      assert (node != [38;5;73mNULL[39;49m);[K
      node->word = argv[argi];[K
      node->link = head;[K
      head = node;[K
   }[K
   [38;5;129mfor[39;49m (node *curr = head; curr->link != [38;5;73mNULL[39;49m; curr = curr->link) {[K
      printf ([38;5;138m"%p->node {word=%p->[%s], link=%p}\n"[39;49m,[K
              curr, curr->word, curr->word, curr->link);[K
   }[K
   [38;5;129mreturn[39;49m 9;[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L1    RCS-1.3  (C/l Abbrev)-------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[2;2H[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;2H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;2H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;2H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m7[39;49m[8;2H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m8[39;49m[9;2H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m9[39;49m[10;2H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m10[39;49m[11;2H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m1[39;49m[12;2H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m3[39;49m[14;2H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m4[39;49m[15;2H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m5[39;49m[16;2H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m6[39;49m[17;2H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m7[39;49m[18;2H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m8[39;49m[19;2H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m7[39;49m[18;2H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m6[39;49m[17;2H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m5[39;49m[16;2H[?12l[?25h[?12;25h[C[C[C[C[C		[C[C[C[C[C[C		[C[C[16;21H		[C[C[C[16;38H[C		[C[?25l[1P[52;6H[30m[48;5;250m**[39;49m[16;30H[?12l[?25h[?12;25h[?25l[1@a[?12l[?25h[?12;25h[?25l[1@r[?12l[?25h[?12;25h[?25l[1@g[?12l[?25h[?12;25h[?25l[1@c[?12l[?25h[?12;25h[1;51r[18;1H[1L[1;53r[16;34H[K
[?25l; ++argi) {[K
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[K[52;35H[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[1;51r[18;1H[1M[1;53r[16;34H[?25l; ++argi) {
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[51;1H[K[52;35H[30m[48;5;250m5[39;49m[16;34H[?12l[?25h[?12;25h[1;51r[18;1H[1L[1;53r[16;34H[K
[?25l; ++argi) {[K
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[K[52;35H[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[1;51r[18;1H[1M[1;53r[16;34H[?25l; ++argi) {
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[51;1H[K[52;35H[30m[48;5;250m5[39;49m[16;34H[?12l[?25h[?12;25h[53;1H[?25lSaving file /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2.c...[16;34H[?12l[?25h[?12;25h[53;1H[?25lWrote /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2.c[K[16;34H[?12l[?25h[?12;25h[52;6H[?25l[30m[48;5;250m----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L15   RCS:[39;49m[16;34H[?12l[?25h[?12;25h[53;1H[K[?1l>[?12l[?25h[?1049l[39;49m
[9]+  Stopped                 emacs list2.c
bash-22$ emacs list2.c[C[C[C[C[C[C[C[C[C[3Pmk list1.c[3@emacs[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[3Pmk[C[C[C[C[C[C[C[C[C[1P.c2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
+ set +x
============================================================
bash-23$ mk list2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
+ set +x
============================================================
bash-23$ script part06.typescript
Script started, file is part06.typescript
[?1034hbash-1$ mk list2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
+ set +x
============================================================
bash-2$ mk list2.c[C[C[C[C[C[C[C[C[Kvla[K[Kalgrind list2 foo bar
==14991== Memcheck, a memory error detector
==14991== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==14991== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==14991== Command: list2 foo bar
==14991== 
0x4c280e0->node {word=0x7ff000109->[bar], link=0x4c28090}
0x4c28090->node {word=0x7ff000105->[foo], link=0x4c28040}
==14991== Conditional jump or move depends on uninitialised value(s)
==14991==    at 0x400684: main (list2.c:22)
==14991== 
==14991== 
==14991== HEAP SUMMARY:
==14991==     in use at exit: 48 bytes in 3 blocks
==14991==   total heap usage: 3 allocs, 0 frees, 48 bytes allocated
==14991== 
==14991== LEAK SUMMARY:
==14991==    definitely lost: 16 bytes in 1 blocks
==14991==    indirectly lost: 32 bytes in 2 blocks
==14991==      possibly lost: 0 bytes in 0 blocks
==14991==    still reachable: 0 bytes in 0 blocks
==14991==         suppressed: 0 bytes in 0 blocks
==14991== Rerun with --leak-check=full to see details of leaked memory
==14991== 
==14991== For counts of detected and suppressed errors, rerun with: -v
==14991== Use --track-origins=yes to see where uninitialised values come from
==14991== ERROR SUMMARY: 1 errors from 1 contexts (suppressed: 6 from 6)
bash-3$ gdb list3[K2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2...done.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

0x601050->node {word=0x7fffffffe184->[bar], link=0x601030}
0x601030->node {word=0x7fffffffe180->[foo], link=0x601010}
[Inferior 1 (process 15050) exited with code 011]
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.5.x86_64
(gdb) where
No stack.
(gdb) list
6	
7	typedef struct node node;
8	struct node {
9	   char *word;
10	   node *link;
11	};
12	
13	int main (int argc, char **argv) {
14	   node *head;
15	   for (int argi = 0; argi < argc; ++argi) {
(gdb) list list2.c:23
18	      node->word = argv[argi];
19	      node->link = head;
20	      head = node;
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) print head
No symbol "head" in current context.
(gdb) bt
No stack.
(gdb) up
No stack.
(gdb) up
No stack.
(gdb) up
No stack.
(gdb) priny[Kt head
No symbol "head" in current context.
(gdb) print *head
No symbol "head" in current context.
(gdb) print *(head->word)
No symbol "head" in current context.
(gdb) print head->link->link->link
No symbol "head" in current context.
(gdb) print *(head->link->link->link)
No symbol "head" in current context.
(gdb) quit
bash-4$ w[Kexit
exit
Script done, file is part06.typescript
bash-24$ script part07.typescript
Script started, file is part07.typescript
[?1034hbash-1$ gdb lid[Kst2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2...done.
(gdb) break mina[K[Ka[K[Kain
Breakpoint 1 at 0x4005bf: file list2.c, line 15.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=3, argv=0x7fffffffde58) at list2.c:15
15	   for (int argi = 0; argi < argc; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.5.x86_64
(gdb) print argc
$1 = 3
(gdb) print agrv
No symbol "agrv" in current context.
(gdb) print agrv[0]
No symbol "agrv" in current context.
(gdb) print agrv[0][C[1P]2][1P]1]
No symbol "agrv" in current context.
(gdb) print agrv[1][1P]2]
No symbol "agrv" in current context.
(gdb) print agrv[2][1P]3]
No symbol "agrv" in current context.
(gdb) print agrv[3][1P]4]
No symbol "agrv" in current context.
(gdb) print agrv[4][1P]5]
No symbol "agrv" in current context.
(gdb) print agrv[5][1P]6]
No symbol "agrv" in current context.
(gdb) quit
A debugging session is active.

	Inferior 1 [process 15747] will be killed.

Quit anyway? (y or n) y
bash-2$ exit
exit
Script done, file is part07.typescript
bash-25$ script part07.typescript6.typescript7.typescript[1Ppart07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[1Ppart07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[C[1Part07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[1Ppart07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[1Ppart07.typescript[C[C[C[C[C[C[C[C[C[C[C[1Ppart07.typescript[C[C[C[C[C[C[C[C[C[C[1Ppart07.typescript[C[C[C[C[C[C[C[C[Crpart07.typescript[C[C[C[C[C[C[C[C[C[Cmpart07.typescript[C[C[C[C[C[C[C[C[C[C[C part07.typescript[C[C[C[C[C[C[C[C[C[C[C[C
rm: remove regular file `part07.typescript'? yes
bash-26$ emacs list2.c
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;124m// $Id: list2.c,v 1.4 2014-02-09 17:24:01-08 - - $                                        [39;49m
[A
[K
[38;5;170m#include[39;49m [38;5;138m<assert.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdlib.h>[39;49m[K
[K
[38;5;129mtypedef[39;49m [38;5;129mstruct[39;49m [38;5;28mnode[39;49m [38;5;28mnode[39;49m;[K
[38;5;129mstruct[39;49m [38;5;28mnode[39;49m {[K
   [38;5;28mchar[39;49m *[38;5;136mword[39;49m;[K
   [38;5;28mnode[39;49m *[38;5;136mlink[39;49m;[K
};[K
[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m ([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m **[38;5;136margv[39;49m) {[K
   [38;5;28mnode[39;49m *[38;5;136mhead[39;49m;[K
   [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;136margi[39;49m = 0; argi < argc; ++argi) {[K
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[K
      assert (node != [38;5;73mNULL[39;49m);[K
      node->word = argv[argi];[K
      node->link = head;[K
      head = node;[K
   }[K
   [38;5;129mfor[39;49m (node *curr = head; curr->link != [38;5;73mNULL[39;49m; curr = curr->link) {[K
      printf ([38;5;138m"%p->node {word=%p->[%s], link=%p}\n"[39;49m,[K
              curr, curr->word, curr->word, curr->link);[K
   }[K
   [38;5;129mreturn[39;49m 9;[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L1    RCS-1.4  (C/l Abbrev)-------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[2d[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m8[39;49m[9;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m9[39;49m[10;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m10[39;49m[11;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m3[39;49m[14;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m4[39;49m[15;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m5[39;49m[16;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[?25l[1P[52;6H[30m[48;5;250m**[39;49m[16;33H[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1@5[?12l[?25h[?12;25h[53;1H[?25lSaving file /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2.c...[16;31H[?12l[?25h[?12;25h[53;1H[?25lWrote /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2.c[K[16;31H[?12l[?25h[?12;25h[52;6H[?25l[30m[48;5;250m----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L15   RCS:[39;49m[16;31H[?12l[?25h[?12;25h[53;1H[K[?1l>[?12l[?25h[?1049l[39;49m
[10]+  Stopped                 emacs list2.c
bash-27$ ls
list1	 list2.c   malloc.c	      part02.typescript  part05.typescript  uninit
list1.c  list2.c~  mk		      part03.typescript  part06.typescript  uninit.c
list2	 malloc    part01.typescript  part04.typescript  RCS
bash-28$ ls[Kscript part07.tyep[K[Ke[Kpescript
Script started, file is part07.typescript
[?1034hbash-1$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005bf: file list2.c, line 15.
(gdb) runn[K foo baar
Starting program: /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2 foo baar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=3, argv=0x7fffffffde48) at list2.c:15
warning: Source file is more recent than executable.
15	   for (int argi = 0; argi < 5; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.5.x86_64
(gdb) quir
Undefined command: "quir".  Try "help".
(gdb) qy[Kuit
A debugging session is active.

	Inferior 1 [process 15934] will be killed.

Quit anyway? (y or n) y
bash-2$ exit
exit
Script done, file is part07.typescript
bash-29$ script part07.typescript\ part07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C\ part07.typescript[1P part07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[1P part07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[1P part07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[C[1P part07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[1P part07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[1P part07.typescript[C[C[C[C[C[C[C[C[C[C[C[1P part07.typescript[C[C[C[C[C[C[C[C[C[C[1P part07.typescript[C[C[C[C[C[C[C[C[Cr part07.typescript[C[C[C[C[C[C[C[C[C[Cm part07.typescript[C[C[C[C[C[C[C[C[C[C[C
rm: remove regular file `part07.typescript'? ^[[A^[[B        y
bash-30$ rm part07.typescript[C[C[C[C[C[C[C[C[C[4@script[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Script started, file is part07.typescript
[?1034hbash-1$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2...done.
(gdb) break mian[K[K[Kain
Breakpoint 1 at 0x4005bf: file list2.c, line 15.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=3, argv=0x7fffffffde58) at list2.c:15
warning: Source file is more recent than executable.
15	   for (int argi = 0; argi < 5; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.5.x86_64
(gdb) quir[Kt
A debugging session is active.

	Inferior 1 [process 16170] will be killed.

Quit anyway? (y or n) y
bash-2$ mk list2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
list2.c: In function â€˜mainâ€™:
list2.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
bash-3$ g[Kgdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2...done.
(gdb) break mia[K[Kain
Breakpoint 1 at 0x4005bf: file list2.c, line 15.
(gdb)  [Krun foo bar
Starting program: /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=3, argv=0x7fffffffde58) at list2.c:15
15	   for (int argi = 0; argi < 5; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.5.x86_64
(gdb) print agrc
No symbol "agrc" in current context.
(gdb) print agrv
No symbol "agrv" in current context.
(gdb) print agrv[0]
No symbol "agrv" in current context.
(gdb) quit
A debugging session is active.

	Inferior 1 [process 16351] will be killed.

Quit anyway? (y or n) y
bash-4$ exit
exit
Script done, file is part07.typescript
bash-31$ emacs[K[K[K[K[Kscript part07.typescript[1P part07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[C[1P part07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[1P part07.typescript[C[C[C[C[C[C[C[C[C[C[C[C[1P part07.typescript[C[C[C[C[C[C[C[C[C[C[C[1P part07.typescript[C[C[C[C[C[C[C[C[C[C[1P part07.typescript[C[C[C[C[C[C[C[C[Cr part07.typescript[C[C[C[C[C[C[C[C[C[Cm part07.typescript[C[C[C[C[C[C[C[C[C[C[C
rm: remove regular file `part07.typescript'? y
bash-32$ mk list3[K2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
list2.c: In function â€˜mainâ€™:
list2.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
bash-33$ emacs list2.c
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;124m// $Id: list2.c,v 1.5 2014-02-09 17:32:40-08 - - $                                        [39;49m
[A
[K
[38;5;170m#include[39;49m [38;5;138m<assert.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdlib.h>[39;49m[K
[K
[38;5;129mtypedef[39;49m [38;5;129mstruct[39;49m [38;5;28mnode[39;49m [38;5;28mnode[39;49m;[K
[38;5;129mstruct[39;49m [38;5;28mnode[39;49m {[K
   [38;5;28mchar[39;49m *[38;5;136mword[39;49m;[K
   [38;5;28mnode[39;49m *[38;5;136mlink[39;49m;[K
};[K
[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m ([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m **[38;5;136margv[39;49m) {[K
   [38;5;28mnode[39;49m *[38;5;136mhead[39;49m;[K
   [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;136margi[39;49m = 0; argi < 5; ++argi) {[K
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[K
      assert (node != [38;5;73mNULL[39;49m);[K
      node->word = argv[argi];[K
      node->link = head;[K
      head = node;[K
   }[K
   [38;5;129mfor[39;49m (node *curr = head; curr->link != [38;5;73mNULL[39;49m; curr = curr->link) {[K
      printf ([38;5;138m"%p->node {word=%p->[%s], link=%p}\n"[39;49m,[K
              curr, curr->word, curr->word, curr->link);[K
   }[K
   [38;5;129mreturn[39;49m 9;[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L1    RCS-1.5  (C/l Abbrev)-------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m8[39;49m[9;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m9[39;49m[10;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m10[39;49m[11;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m3[39;49m[14;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m4[39;49m[15;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m5[39;49m[16;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m7[39;49m[18;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m8[39;49m[19;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m9[39;49m[20;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m8[39;49m[19;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m7[39;49m[18;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[52;35H[?25l[30m[48;5;250m6[39;49m[17;29H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m5[39;49m[16;29H[?12l[?25h[?12;25h[C[C[?25l[1P[52;6H[30m[48;5;250m**[39;49m[16;30H[?12l[?25h[?12;25h[?25l[1@a[?12l[?25h[?12;25h[?25l[1@r[?12l[?25h[?12;25h[?25l[1@g[?12l[?25h[?12;25h[?25l[1@c[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m6[39;49m[17;34H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m7[39;49m[18;29H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m8[39;49m[19;31H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m9[39;49m[20;25H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m20[39;49m[21;19H[?12l[?25h[?12;25h[53;1H[?25lAuto-saving...[21;19H[?12l[?25h[?12;25h[53;15H[?25ldone[21d[?12l[?25h[?12;25h[53;1H[K[21;19H[53;1H[?25lSaving file /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2.c...[21;19H[?12l[?25h[?12;25h[53;1H[?25lWrote /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2.c[K[21;19H[?12l[?25h[?12;25h[52;6H[?25l[30m[48;5;250m----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L20   RCS:[39;49m[21;19H[?12l[?25h[?12;25h[53;1H[K[?1l>[?12l[?25h[?1049l[39;49m
[11]+  Stopped                 emacs list2.c
bash-34$ mk list3[K2.c
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
+ set +x
============================================================
bash-35$ emacs list2.c
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[A[?25l[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A[52d[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;124m// $Id: list2.c,v 1.6 2014-02-09 17:37:25-08 - - $                                        [39;49m
[A
[K
[38;5;170m#include[39;49m [38;5;138m<assert.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[38;5;170m#include[39;49m [38;5;138m<stdlib.h>[39;49m[K
[K
[38;5;129mtypedef[39;49m [38;5;129mstruct[39;49m [38;5;28mnode[39;49m [38;5;28mnode[39;49m;[K
[38;5;129mstruct[39;49m [38;5;28mnode[39;49m {[K
   [38;5;28mchar[39;49m *[38;5;136mword[39;49m;[K
   [38;5;28mnode[39;49m *[38;5;136mlink[39;49m;[K
};[K
[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m ([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m **[38;5;136margv[39;49m) {[K
   [38;5;28mnode[39;49m *[38;5;136mhead[39;49m;[K
   [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;136margi[39;49m = 0; argi < argc; ++argi) {[K
      [38;5;28mnode[39;49m *[38;5;136mnode[39;49m = malloc ([38;5;129msizeof[39;49m ([38;5;129mstruct[39;49m [38;5;28mnode[39;49m));[K
      assert (node != [38;5;73mNULL[39;49m);[K
      node->word = argv[argi];[K
      node->link = head;[K
      head = node;[K
   }[K
   [38;5;129mfor[39;49m (node *curr = head; curr->link != [38;5;73mNULL[39;49m; curr = curr->link) {[K
      printf ([38;5;138m"%p->node {word=%p->[%s], link=%p}\n"[39;49m,[K
              curr, curr->word, curr->word, curr->link);[K
   }[K
   [38;5;129mreturn[39;49m 9;[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mlist2.c     [0m[39;49m[30m[48;5;250m   All L1    RCS-1.6  (C/l Abbrev)-------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m8[39;49m[9;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m9[39;49m[10;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m10[39;49m[11;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m3[39;49m[14;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m4[39;49m[15;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m5[39;49m[16;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m7[39;49m[18;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m8[39;49m[19;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m9[39;49m[20;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m20[39;49m[21;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m1[39;49m[22;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m2[39;49m[23;1H[?12l[?25h[?12;25h[52;35H[?25l[30m[48;5;250m3[39;49m[24;1H[?12l[?25h[?12;25h[53d[?25l(No changes need to be saved)[24;1H[?12l[?25h[?12;25h[53d[K[?1l>[?12l[?25h[?1049l[39;49m
[12]+  Stopped                 emacs list2.c
bash-36$ rm list2[K[K[K[K[K[K[K[Kcp list2 [K.c list[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kls
list1	 list2.c   malloc.c	      part02.typescript  part05.typescript  uninit
list1.c  list2.c~  mk		      part03.typescript  part06.typescript  uninit.c
list2	 malloc    part01.typescript  part04.typescript  RCS
bash-37$ lsemacs list2.c[C[C[C[C[C[C[C[C[C[3Pmk[C[C[C[C[C[C[C[C[3@emacs[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[3Pmk[C[C[C[C[C[C[C[Crm part07.typescript[C[C[C[C[C[C[C[C[C[4@script[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Script started, file is part07.typescript
[?1034hbash-1$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005bf: file list2.c, line 15.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=3, argv=0x7fffffffde58) at list2.c:15
15	   for (int argi = 0; argi < argc; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.5.x86_64
(gdb) print arc[Kd[Kgc
$1 = 3
(gdb) print argc[Kv
$2 = (char **) 0x7fffffffde58
(gdb) print argv[0]
$3 = 0x7fffffffe140 "/afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list2"
(gdb) print argv[0][1P]1]
$4 = 0x7fffffffe180 "foo"
(gdb) print argv[1][1P]2]
$5 = 0x7fffffffe184 "bar"
(gdb) print argv[2][1P]3]
$6 = 0x0
(gdb) print argv[3][1P]4]
$7 = 0x7fffffffe188 "MANWIDTH=72"
(gdb) print argv[4][1P]5]
$8 = 0x7fffffffe194 "MANPATH=/opt/rh/devtoolset-2/root/usr/share/man:"
(gdb) print argv[5][1P]6]
$9 = 0x7fffffffe1c5 "HOSTNAME=unix2.lt.ucsc.edu"
(gdb) quit
A debugging session is active.

	Inferior 1 [process 17211] will be killed.

Quit anyway? (y or n) y
bash-2$ exit
exit
Script done, file is part07.typescript
bash-38$ cp list2.c list3.c
bash-39$ lissdsas[K[K[K[K[K[K[K[Kscript part08.typescript
Script started, file is part08.typescript
[?1034hbash-1$ valgrind --leak-check=fi[Kull \[Klist2[K3 foo bar baz quz
valgrind: list3: command not found
bash-2$ valgrind --leak-check=full list3 foo bar baz quz[1@\[1@ 
valgrind:  list3: command not found
bash-3$ valgrind --leak-check=full \ list3 foo bar baz quz[1P[1P
valgrind: list3: command not found
bash-4$ exit
exit
Script done, file is part08.typescript
bash-40$ mk list3.c
CSOURCE=list3.c EXECBIN=list3
+ cid + list3.c
+ checksource list3.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list3.c -o list3 -lm
+ set +x
============================================================
bash-41$ mk list3.cscript part08.typescript[C[C[C[C[C[C[C[C[C[6Pcp list2.c list3.c[C[C[C[C[C[C[C[C[Cscript part08.typescript[1P part08.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[C[1P part08.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[1P part08.typescript[C[C[C[C[C[C[C[C[C[C[C[C[1P part08.typescript[C[C[C[C[C[C[C[C[C[C[C[1P part08.typescript[C[C[C[C[C[C[C[C[C[C[1P part08.typescript[C[C[C[C[C[C[C[C[Cr part08.typescript[C[C[C[C[C[C[C[C[C[Cm part08.typescript[C[C[C[C[C[C[C[C[C[C[C
rm: remove regular file `part08.typescript'? yes
bash-42$ rm part08.typescript[1P part08.typescript[C[C[C[C[C[C[C[C[C[C[1P part08.typescript[C[C[C[C[C[C[C[C[Cs part08.typescript[C[C[C[C[C[C[C[C[C[Cc part08.typescript[C[C[C[C[C[C[C[C[C[C[Cr part08.typescript[C[C[C[C[C[C[C[C[C[C[C[Ci part08.typescript[C[C[C[C[C[C[C[C[C[C[C[C[Cp part08.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[Ct part08.typescript[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C
Script started, file is part08.typescript
[?1034hbash-1$ valgrind --leak-check=full list3 foo bar baz quz
==17903== Memcheck, a memory error detector
==17903== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==17903== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==17903== Command: list3 foo bar baz quz
==17903== 
0x4c28180->node {word=0x7ff000109->[quz], link=0x4c28130}
0x4c28130->node {word=0x7ff000105->[baz], link=0x4c280e0}
0x4c280e0->node {word=0x7ff000101->[bar], link=0x4c28090}
0x4c28090->node {word=0x7ff0000fd->[foo], link=0x4c28040}
==17903== Conditional jump or move depends on uninitialised value(s)
==17903==    at 0x400684: main (list3.c:22)
==17903== 
==17903== 
==17903== HEAP SUMMARY:
==17903==     in use at exit: 80 bytes in 5 blocks
==17903==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==17903== 
==17903== 80 (16 direct, 64 indirect) bytes in 1 blocks are definitely lost in loss record 2 of 2
==17903==    at 0x4A06A2E: malloc (in /opt/rh/devtoolset-2/root/usr/lib64/valgrind/vgpreload_memcheck-amd64-linux.so)
==17903==    by 0x4005D1: main (list3.c:16)
==17903== 
==17903== LEAK SUMMARY:
==17903==    definitely lost: 16 bytes in 1 blocks
==17903==    indirectly lost: 64 bytes in 4 blocks
==17903==      possibly lost: 0 bytes in 0 blocks
==17903==    still reachable: 0 bytes in 0 blocks
==17903==         suppressed: 0 bytes in 0 blocks
==17903== 
==17903== For counts of detected and suppressed errors, rerun with: -v
==17903== Use --track-origins=yes to see where uninitialised values come from
==17903== ERROR SUMMARY: 2 errors from 2 contexts (suppressed: 6 from 6)
bash-2$ cp list2[K3.c list4.c
bash-3$ mk list4.c
CSOURCE=list4.c EXECBIN=list4
+ cid + list4.c
+ checksource list4.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list4.c -o list4 -lm
+ set +x
============================================================
bash-4$ script part09.typescript
Script started, file is part09.typescript
[?1034hbash-1$ valgrind --leak-chex[Kck=full list4 foo bar baz quz
==18362== Memcheck, a memory error detector
==18362== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==18362== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==18362== Command: list4 foo bar baz quz
==18362== 
0x4c28180->node {word=0x7ff0000b5->[quz], link=0x4c28130}
0x4c28130->node {word=0x7ff0000b1->[baz], link=0x4c280e0}
0x4c280e0->node {word=0x7ff0000ad->[bar], link=0x4c28090}
0x4c28090->node {word=0x7ff0000a9->[foo], link=0x4c28040}
==18362== Conditional jump or move depends on uninitialised value(s)
==18362==    at 0x400684: main (list4.c:22)
==18362== 
==18362== 
==18362== HEAP SUMMARY:
==18362==     in use at exit: 80 bytes in 5 blocks
==18362==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==18362== 
==18362== 80 (16 direct, 64 indirect) bytes in 1 blocks are definitely lost in loss record 2 of 2
==18362==    at 0x4A06A2E: malloc (in /opt/rh/devtoolset-2/root/usr/lib64/valgrind/vgpreload_memcheck-amd64-linux.so)
==18362==    by 0x4005D1: main (list4.c:16)
==18362== 
==18362== LEAK SUMMARY:
==18362==    definitely lost: 16 bytes in 1 blocks
==18362==    indirectly lost: 64 bytes in 4 blocks
==18362==      possibly lost: 0 bytes in 0 blocks
==18362==    still reachable: 0 bytes in 0 blocks
==18362==         suppressed: 0 bytes in 0 blocks
==18362== 
==18362== For counts of detected and suppressed errors, rerun with: -v
==18362== Use --track-origins=yes to see where uninitialised values come from
==18362== ERROR SUMMARY: 2 errors from 2 contexts (suppressed: 6 from 6)
bash-2$ echo $?
9
bash-3$ exit
exit
Script done, file is part09.typescript
bash-5$ list[K[K[K[Kdgb [K[K[K[Kgdb list2[K3
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/list3...done.
(gdb) quit
bash-6$ exit[K[K[K[Kls
list1	 list2.c~  list4.c   part01.typescript	part05.typescript  part09.typescript
list1.c  list3	   malloc    part02.typescript	part06.typescript  RCS
list2	 list3.c   malloc.c  part03.typescript	part07.typescript  uninit
list2.c  list4	   mk	     part04.typescript	part08.typescript  uninit.c
bash-7$ emacs environ.c
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25l(New file)[K[H
[?12l[?25h[?12;25h[53d[?25l(New file)[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250menviron.c   [0m[39;49m[30m[48;5;250m   All L1     (C/l Abbrev)---------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[2d[?25l#[52;6H[30m[48;5;250m**[39;49m[2;2H[?12l[?25h[?12;25h[?25l[38;5;170m#i[39;49m[?12l[?25h[?12;25h[?25l[38;5;170mn[39;49m[?12l[?25h[?12;25h[?25l[38;5;170mc[39;49m[?12l[?25h[?12;25h[?25l[38;5;170ml[39;49m[?12l[?25h[?12;25h[?25l[38;5;170mu[39;49m[?12l[?25h[?12;25h[?25l[38;5;170md[39;49m[?12l[?25h[?12;25h[?25l[38;5;170me[39;49m[?12l[?25h[?12;25h[C[?25l[38;5;138m<[39;49m[?12l[?25h[?12;25h[?25l[38;5;138ms[39;49m[?12l[?25h[?12;25h[?25l[38;5;138mt[39;49m[?12l[?25h[?12;25h[?25l[38;5;138md[39;49m[?12l[?25h[?12;25h[?25l[38;5;138mi[39;49m[?12l[?25h[?12;25h[?25l[38;5;138mo[39;49m[?12l[?25h[?12;25h[?25l[38;5;138m.[39;49m[?12l[?25h[?12;25h[?25l[38;5;138mh[39;49m[?12l[?25h[?12;25h[?25l[38;5;138m>[39;49m[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[?25li[?12l[?25h[?12;25h[?25ln[?12l[?25h[?12;25h[?25l[38;5;28mint[39;49m[?12l[?25h[?12;25h[C[?25l[38;5;136mm[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mi[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mn[39;49m[?12l[?25h[?12;25h[?25l[38;5;136ma[39;49m[?12l[?25h[?12;25h[K[K[?25l[38;5;136ma[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mn[39;49m[?12l[?25h[?12;25h[K[K[K[?25l[38;5;136ma[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mi[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mn[39;49m[?12l[?25h[?12;25h[?25l[38;5;21mmain[39;49m([?12l[?25h[?12;25h[?25li[?12l[?25h[?12;25h[?25ln[?12l[?25h[?12;25h[?25l[38;5;28mint[39;49m[?12l[?25h[?12;25h[C[?25l[38;5;136ma[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mr[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mg[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mc[39;49m[?12l[?25h[?12;25h[?25l,[?12l[?25h[?12;25h[C[?25lc[?12l[?25h[?12;25h[?25lh[?12l[?25h[?12;25h[?25la[?12l[?25h[?12;25h[?25l[38;5;28mchar[39;49m[?12l[?25h[?12;25h	[?25l*[?12l[?25h[?12;25h[?25l*[?12l[?25h[?12;25h[?25l[38;5;136ma[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mr[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mg[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mv[39;49m[?12l[?25h[?12;25h[?25l)	[?12l[?25h[?12;25h			[?25l{[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[?25l}[52;34H[30m[48;5;250m3[39;49m[4;32H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[C[C[C[53;1H[?25lAuto-saving...[5;4H[?12l[?25h[?12;25h[53;15H[?25ldone[5;4H[?12l[?25h[?12;25h[53;1H[K[5;4H[?25le[?12l[?25h[?12;25h[?25lx[?12l[?25h[?12;25h[?25lt[?12l[?25h[?12;25h[?25le[?12l[?25h[?12;25h[?25lr[?12l[?25h[?12;25h[?25l[38;5;129mextern[39;49m[?12l[?25h[?12;25h[C[?25l[38;5;28mc[39;49m[?12l[?25h[?12;25h[?25l[38;5;28mh[39;49m[?12l[?25h[?12;25h[?25l[38;5;28ma[39;49m[?12l[?25h[?12;25h[?25l[38;5;28mr[39;49m[?12l[?25h[?12;25h	[?25l*[?12l[?25h[?12;25h[?25l*[?12l[?25h[?12;25h[C[?25l[38;5;136me[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mn[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mv[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mi[39;49m[?12l[?25h[?12;25h[?25l[38;5;136ms[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mi[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mo[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mn[39;49m[?12l[?25h[?12;25h[K[K[K[K[?25l[38;5;136mr[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mo[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mn[39;49m[?12l[?25h[?12;25h[5;3H[1P			[?25l;[?12l[?25h[?12;25h
[K
[?25l}[52;34H[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[C[C[?25lf[?12l[?25h[?12;25h[?25lo[?12l[?25h[?12;25h[?25l[38;5;129mfor[39;49m[?12l[?25h[?12;25h[?25l([?12l[?25h[?12;25h[?25li[?12l[?25h[?12;25h[?25ln[?12l[?25h[?12;25h[?25l[38;5;28mint[39;49m[?12l[?25h[?12;25h[C[?25l[38;5;136mi[39;49m[?12l[?25h[?12;25h[C[?25l=[?12l[?25h[?12;25h[C[?25l0[?12l[?25h[?12;25h[?25l;[?12l[?25h[?12;25h[C[?25li[?12l[?25h[?12;25h[C[?25l<[?12l[?25h[?12;25h[C[?25la[?12l[?25h[?12;25h[?25lr[?12l[?25h[?12;25h[?25lg[?12l[?25h[?12;25h[?25lc[?12l[?25h[?12;25h[?25l;[?12l[?25h[?12;25h[C[?25li[?12l[?25h[?12;25h[?25l+[?12l[?25h[?12;25h[?25l+[?12l[?25h[?12;25h[?25l)[6;6H[?12l[?25h[?12;25h				[?25l{[?12l[?25h[?12;25h
[K
[?25l}[52;34H[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h
[K
[?25l}[52;34H[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[C[C[?25l}[52;34H[30m[48;5;250m5[39;49m[6;32H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[C[C[C[C[52;34H[?25l[30m[48;5;250m7[39;49m[8;4H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;5H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;5H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;5H[?12l[?25h[?12;25h[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[K[K[K[K[K[K[K[K[K[K[C[K[K[K[K[C[5;3H[?25lexter[K[?12l[?25h[?12;25h[K[K[K[K[K[5;3H[1;51r[6;1H[1M[1;53r[5;3H[?25l[38;5;129mfor[39;49m([38;5;28mint[39;49m [38;5;136mi[39;49m = 0; i < argc; i++){[51;1H[K[52;34H[30m[48;5;250m3[39;49m[4;33H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[1;51r[5;1H[1L[1;53r[4;1H[K
[?25l[38;5;28mint[39;49m [38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m **[38;5;136margv[39;49m){[K[52;34H[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[?25le[?12l[?25h[?12;25h[?25lx[?12l[?25h[?12;25h[?25lt[?12l[?25h[?12;25h[?25le[?12l[?25h[?12;25h[?25lr[?12l[?25h[?12;25h[?25l[38;5;129mextern[39;49m[?12l[?25h[?12;25h	[?25l[38;5;28mc[39;49m[?12l[?25h[?12;25h[?25lch[?12l[?25h[?12;25h[?25la[?12l[?25h[?12;25h[?25l[38;5;28mchar[39;49m[5;5Hmain[4;12H[?12l[?25h[?12;25h[C[?25l*[?12l[?25h[?12;25h[?25l*[?12l[?25h[?12;25h[?25l[38;5;21me[39;49m[?12l[?25h[?12;25h[?25l[38;5;21mb[39;49m[?12l[?25h[?12;25h[K[?25l[38;5;21mn[39;49m[?12l[?25h[?12;25h[?25l[38;5;21mv[39;49m[?12l[?25h[?12;25h[?25l[38;5;21mi[39;49m[?12l[?25h[?12;25h[?25l[38;5;21mr[39;49m[?12l[?25h[?12;25h[?25l[38;5;21mo[39;49m[?12l[?25h[?12;25h[?25l[38;5;21mn[39;49m[?12l[?25h[?12;25h[4;15H[?25l[38;5;136menviron[39;49m;[5;5H[38;5;21mmain[39;49m[4;23H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;23H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;23H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;5H[?12l[?25h[?12;25h[?25lp[?12l[?25h[?12;25h[?25lr[?12l[?25h[?12;25h[?25li[?12l[?25h[?12;25h[?25ln[?12l[?25h[?12;25h[?25lt[?12l[?25h[?12;25h[?25lf[?12l[?25h[?12;25h[?25l([?12l[?25h[?12;25h[?25l[1m[91m"[0m[39;49m[38;5;138m                                                                              [39;49m
[38;5;138m  }                                                                                       [39;49m
[7;13H[?12l[?25h[?12;25h

[?25l[38;5;138m}                                                                                         [39;49m
[7;13H[?12l[?25h[?12;25h[?25l[38;5;138mS[39;49m[?12l[?25h[?12;25h[?25l[38;5;138m [39;49m[?12l[?25h[?12;25h[?25l[38;5;138m%[39;49m[?12l[?25h[?12;25h[?25l[38;5;138ms[39;49m[?12l[?25h[?12;25h[?25l[38;5;138m"%s"[39;49m[K
  }[K[7;16H[?12l[?25h[?12;25h

[?25l}[K[7;16H[?12l[?25h[?12;25h[?25l,[?12l[?25h[?12;25h[?25la[?12l[?25h[?12;25h[?25lr[?12l[?25h[?12;25h[?25lg[?12l[?25h[?12;25h[?25lv[?12l[?25h[?12;25h[K[K[K[K[?25le[?12l[?25h[?12;25h[?25ln[?12l[?25h[?12;25h[?25lv[?12l[?25h[?12;25h[?25li[?12l[?25h[?12;25h[?25lr[?12l[?25h[?12;25h[?25lo[?12l[?25h[?12;25h[?25ln[?12l[?25h[?12;25h[?25l[[?12l[?25h[?12;25h[?25la[?12l[?25h[?12;25h[?25lg[?12l[?25h[?12;25h[?25lr[?12l[?25h[?12;25h[?25lc[?12l[?25h[?12;25h[?25l][?12l[?25h[?12;25h[7;30H[52;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;30H[?12l[?25h[?12;25h[?25l)[7;11H[?12l[?25h[?12;25h[7;31H[?25l;[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m7[39;49m[8;4H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;32H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;32H[?12l[?25h[?12;25h[C[52;34H[?25l[30m[48;5;250m4[39;49m[5;26H[?12l[?25h[?12;25h[C[C[C[C[53;1H[?25lAuto-saving...[5;30H[?12l[?25h[?12;25h[53;15H[?25ldone[5;30H[?12l[?25h[?12;25h[53;1H[K[5;31H[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25lcha){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25le){[?12l[?25h[?12;25h[?25ln){[?12l[?25h[?12;25h[?25lv){[?12l[?25h[?12;25h[?25li){[?12l[?25h[?12;25h[?25lr){[?12l[?25h[?12;25h[?25li){[?12l[?25h[?12;25h[?25lo){[?12l[?25h[?12;25h[?25ln){[?12l[?25h[?12;25h[?25lrion){[K[?12l[?25h[?12;25h		[?25lon){[K[?12l[?25h[?12;25h[?25lon){[K[?12l[?25h[?12;25h[?25lion){[?12l[?25h[?12;25h[?25lron){[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;25H[?12l[?25h[?12;25h[C[53;1H[?25lAuto-saving...[6;26H[?12l[?25h[?12;25h[53;15H[?25ldone[6;26H[?12l[?25h[?12;25h[53;1H[K[52;34H[?25l[30m[48;5;250m4[39;49m[5;26H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;23H[?12l[?25h[?12;25h[53;1H[?25lSaving file /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/environ.c...[4;23H[?12l[?25h[?12;25h[53;1H[?25lWrote /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/environ.c[K[4;23H[?12l[?25h[?12;25h[52;6H[?25l[30m[48;5;250m--[39;49m[4;23H[?12l[?25h[?12;25h[53;1H[K[?1l>[?12l[?25h[?1049l[39;49m
[1]+  Stopped                 emacs environ.c
bash-8$ mk environ
./mk: environ: is not a C source file
bash-9$ mk environ.c
CSOURCE=environ.c EXECBIN=environ
+ cid + environ.c
+ checksource environ.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 environ.c -o environ -lm
environ.c:4:20: error: expected declaration specifiers or â€˜...â€™ before â€˜environâ€™
 int main(int argc, environ){
                    ^
+ set +x
============================================================
bash-10$ eman[Kcs environ.c
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[K
[38;5;129mextern[39;49m [38;5;28mchar[39;49m **[38;5;136menviron[39;49m;[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;136margc[39;49m, environ){[K
  [38;5;129mfor[39;49m([38;5;28mint[39;49m [38;5;136mi[39;49m = 0; i < argc; i++){[K
    printf([38;5;138m"%s"[39;49m,environ[agrc]);[K
  }[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250menviron.c   [0m[39;49m[30m[48;5;250m   All L1    RCS-1.1  (C/l Abbrev)-------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[1;10r[5;1H[1L[1;53r[5;1H[K[52;6H[?25l[30m[48;5;250m**--F1  [39;49m[1m[30m[48;5;250menviron.c   [0m[39;49m[30m[48;5;250m   All L5[39;49m[6;1H[?12l[?25h[?12;25h[1;51r[7;1H[1M[1;53r[5;1H[?25l[38;5;28mint[39;49m [38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;136margc[39;49m, environ){
  [38;5;129mfor[39;49m([38;5;28mint[39;49m [38;5;136mi[39;49m = 0; i < argc; i++){[51;1H[K[52;34H[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[?25l[38;5;136mviron[39;49m;[K		[?12l[?25h[?12;25h	[C[C[C[C[C[52;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[1;51r[6;1H[1M[1;53r[4;22H[?25l[38;5;28mint[39;49m [38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;136margc[39;49m, environ){
  [38;5;129mfor[39;49m([38;5;28mint[39;49m [38;5;136mi[39;49m = 0; i < argc; i++){[51;1H[K[52;34H[30m[48;5;250m3[39;49m[4;22H[?12l[?25h[?12;25h[4;15H[?25l[38;5;21mevironint[39;49m main[1P[4;21H[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[38;5;28mint[39;49m[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[38;5;28mint[39;49m [38;5;21mmain[39;49m[1P[4;12H[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[38;5;28mextern[39;49m[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[?25l[1P[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25li){[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25lc){[?12l[?25h[?12;25h[?25lh){[?12l[?25h[?12;25h[?25la){[?12l[?25h[?12;25h[?25l[38;5;28mchar[39;49m){[?12l[?25h[?12;25h[?25l ){[?12l[?25h[?12;25h[?25l*){[?12l[?25h[?12;25h[?25l*){[?12l[?25h[?12;25h[?25l[38;5;136ma[39;49m){[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l[38;5;136ma[39;49m){[?12l[?25h[?12;25h[?25l[38;5;136mr[39;49m){[?12l[?25h[?12;25h[?25l[38;5;136mg[39;49m){[?12l[?25h[?12;25h[?25l[38;5;136mc[39;49m){[?12l[?25h[?12;25h[?25l){[K[?12l[?25h[?12;25h[?25l[38;5;136mv[39;49m){[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;30H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;30H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;24H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;24H[?12l[?25h[?12;25h	[C[C[C[C[C[C	[52;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[C[52;34H[?25l[30m[48;5;250m3[39;49m[4;32H[?12l[?25h[?12;25h[1;51r[6;1H[1L[1;53r[5;1H[K
[?25l  [38;5;129mfor[39;49m([38;5;28mint[39;49m [38;5;136mi[39;49m = 0; i < argc; i++){[K[52;34H[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[C[C[?25lw[?12l[?25h[?12;25h[K[5;3H[?25le[?12l[?25h[?12;25h[?25lx[?12l[?25h[?12;25h[?25lt[?12l[?25h[?12;25h[?25le[?12l[?25h[?12;25h[?25lr[?12l[?25h[?12;25h[?25l[38;5;129mextern[39;49m[?12l[?25h[?12;25h[C[?25l[38;5;28mc[39;49m[?12l[?25h[?12;25h[?25l[38;5;28mh[39;49m[?12l[?25h[?12;25h[?25l[38;5;28ma[39;49m[?12l[?25h[?12;25h[?25l[38;5;28mr[39;49m[?12l[?25h[?12;25h[C[?25l*[?12l[?25h[?12;25h[?25l*[?12l[?25h[?12;25h[?25l[38;5;136me[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mn[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mv[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mi[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mr[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mo[39;49m[?12l[?25h[?12;25h[?25l[38;5;136mn[39;49m[?12l[?25h[?12;25h[?25l;[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;25H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;25H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;25H[?12l[?25h[?12;25h[53;1H[?25lAuto-saving...[6;25H[?12l[?25h[?12;25h[53;15H[?25ldone[6;25H[?12l[?25h[?12;25h[53;1H[K[52;34H[?25l[30m[48;5;250m4[39;49m[5;25H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;25H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;25H[?12l[?25h[?12;25h[C[C[C[C[C[C[?25l[1@ [?12l[?25h[?12;25h[C[C[C[C[C		[C[C[C[C[52;34H[?25l[30m[48;5;250m5[39;49m[6;29H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;24H[?12l[?25h[?12;25h	[C[C[C[C[C[C		[52;34H[?25l[30m[48;5;250m5[39;49m[6;33H[?12l[?25h[?12;25h[1;51r[8;1H[1L[1;53r[7;1H[K
[?25l    printf([38;5;138m"%s"[39;49m, environ[agrc]);[K[52;34H[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[C[C[C[C[?25l[38;5;28mi[39;49m
[38;5;136mprintf[39;49m([38;5;138m"%s"[39;49m, [38;5;28menviron[39;49m[7;6H[?12l[?25h[?12;25h[?25l[38;5;129mif[39;49m
printf([38;5;138m"%s"[39;49m, environ[7;7H[?12l[?25h[?12;25h[?25l([?12l[?25h[?12;25h[?25l[38;5;28me[39;49m
[38;5;136mprintf[39;49m([38;5;138m"%s"[39;49m, [38;5;28menviron[39;49m[A	[?12l[?25h[?12;25h[?25l[38;5;28mn[39;49m[?12l[?25h[?12;25h[?25l[38;5;28mv[39;49m[?12l[?25h[?12;25h[?25l[38;5;28mi[39;49m[?12l[?25h[?12;25h[?25l[38;5;28mr[39;49m[?12l[?25h[?12;25h[?25l[38;5;28mo[39;49m[?12l[?25h[?12;25h[?25l[38;5;28mn[39;49m[?12l[?25h[?12;25h	[?25lenviron[[8;5Hprintf([38;5;138m"%s"[39;49m, environ[7;16H[?12l[?25h[?12;25h[?25la[?12l[?25h[?12;25h[?25lr[?12l[?25h[?12;25h[?25lg[?12l[?25h[?12;25h[?25lc[?12l[?25h[?12;25h[?25l][?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;21H[?12l[?25h[?12;25h[C[?25l=[?12l[?25h[?12;25h[?25l=[?12l[?25h[?12;25h	[?25ln[?12l[?25h[?12;25h[?25lu[?12l[?25h[?12;25h[?25ll[?12l[?25h[?12;25h[?25ll[?12l[?25h[?12;25h[K[K[K[K	[?25lN[?12l[?25h[?12;25h[?25lU[?12l[?25h[?12;25h[?25lL[?12l[?25h[?12;25h[?25l[38;5;73mNULL[39;49m[?12l[?25h[?12;25h[?25l)[7;7H[?12l[?25h[?12;25h[7;30H[?25l{[?12l[?25h[?12;25h[1;51r[9;1H[1L[1;53r[8;1H[K
[?25l    printf([38;5;138m"%s"[39;49m, environ[agrc]);[K[52;34H[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[C[C[C[C[?25l}[52;34H[30m[48;5;250m6[39;49m[7;30H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m7[39;49m[8;6H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;6H[?12l[?25h[?12;25h[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C[52;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m6[39;49m[7;31H[?12l[?25h[?12;25h[1;51r[9;1H[1L[1;53r[8;1H[K
[?25l    }[K[52;34H[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[C[C[C[C[C[C[?25lr[?12l[?25h[?12;25h[?25le[?12l[?25h[?12;25h[?25lt[?12l[?25h[?12;25h[?25lu[?12l[?25h[?12;25h[?25lt[?12l[?25h[?12;25h[53;1H[?25lAuto-saving...[8;12H[?12l[?25h[?12;25h[53;15H[?25ldone[8;12H[?12l[?25h[?12;25h[53;1H[K[8;12H[?25ln[?12l[?25h[?12;25h[K[K[?25lt[?12l[?25h[?12;25h[?25ln[?12l[?25h[?12;25h[K[K[?25lr[?12l[?25h[?12;25h[?25l[38;5;129mreturn[39;49m[?12l[?25h[?12;25h[?25l;[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m8[39;49m[9;6H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m9[39;49m[10;14H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m10[39;49m[11;4H[?12l[?25h[?12;25h
[K
[?25l}[52;35H[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[?25lr[?12l[?25h[?12;25h[?25le[?12l[?25h[?12;25h[?25lt[?12l[?25h[?12;25h[?25lu[?12l[?25h[?12;25h[?25lr[?12l[?25h[?12;25h[?25l[38;5;129mreturn[39;49m[?12l[?25h[?12;25h[?25lretur[K[?12l[?25h[?12;25h[K[K[K[K[K[C[C[?25lr[?12l[?25h[?12;25h[?25le[?12l[?25h[?12;25h[?25ly[?12l[?25h[?12;25h[K[?25lt[?12l[?25h[?12;25h[?25lu[?12l[?25h[?12;25h[?25lr[?12l[?25h[?12;25h[?25l[38;5;129mreturn[39;49m[?12l[?25h[?12;25h[C[?25l1[?12l[?25h[?12;25h[?25l;[?12l[?25h[?12;25h[53;1H[?25lSaving file /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/environ.c...[12;12H[?12l[?25h[?12;25h[53;1H[?25lWrote /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/environ.c[K[12;12H[?12l[?25h[?12;25h[52;6H[?25l[30m[48;5;250m----F1  [39;49m[1m[30m[48;5;250menviron.c   [0m[39;49m[30m[48;5;250m   All L11   RCS:[39;49m[12;12H[?12l[?25h[?12;25h[53;1H[K[?1l>[?12l[?25h[?1049l[39;49m
[2]+  Stopped                 emacs environ.c
bash-11$ mk[Kk [K[K[Kemacs environ.c[C[C[C[C[C[C[C[C[C[3Pmk[C[C[C[C[C[C[C[C[C[C
CSOURCE=environ.c EXECBIN=environ
+ cid + environ.c
+ checksource environ.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 environ.c -o environ -lm
environ.c:3:5: warning: second argument of â€˜mainâ€™ should be â€˜char **â€™ [-Wmain]
 int main(int argc, char *argv){
     ^
environ.c: In function â€˜mainâ€™:
environ.c:7:7: warning: â€˜returnâ€™ with no value, in function returning non-void [enabled by default]
       return;
       ^
environ.c:9:26: error: â€˜agrcâ€™ undeclared (first use in this function)
     printf("%s", environ[agrc]);
                          ^
environ.c:9:26: note: each undeclared identifier is reported only once for each function it appears in
environ.c:3:26: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main(int argc, char *argv){
                          ^
+ set +x
============================================================
bash-12$ mk environ.c[C[C[C[C[C[C[C[C[C[3@emacs[C[C[C[C[C[C[C[C[C[C
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m *[38;5;136margv[39;49m){[K
  [38;5;129mextern[39;49m [38;5;28mchar[39;49m **[38;5;136menviron[39;49m;[K
  [38;5;129mfor[39;49m([38;5;28mint[39;49m [38;5;136mi[39;49m = 0; i < argc; i++){[K
    [38;5;129mif[39;49m(environ[argc] == [38;5;73mNULL[39;49m){[K
      [38;5;129mreturn[39;49m;[K
    }[K
    printf([38;5;138m"%s"[39;49m, environ[agrc]);[K
  }[K
  [38;5;129mreturn[39;49m 1;[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250menviron.c   [0m[39;49m[30m[48;5;250m   All L1    RCS-1.2  (C/l Abbrev)-------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[2d[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[?25l*[38;5;136margv[39;49m){[52;6H[30m[48;5;250m**[39;49m[4;26H[?12l[?25h[?12;25h[53;1H[?25lSaving file /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/environ.c...[4;26H[?12l[?25h[?12;25h[53;1H[?25lWrote /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/environ.c[K[4;26H[?12l[?25h[?12;25h[52;6H[?25l[30m[48;5;250m----F1  [39;49m[1m[30m[48;5;250menviron.c   [0m[39;49m[30m[48;5;250m   All L3    RCS:[39;49m[4;26H[?12l[?25h[?12;25h[53;1H[K[?1l>[?12l[?25h[?1049l[39;49m
[3]+  Stopped                 emacs environ.c
bash-13$ emacs environ.c[C[C[C[C[C[C[C[C[C[3Pmk[C[C[C[C[C[C[C[C[C[C
CSOURCE=environ.c EXECBIN=environ
+ cid + environ.c
+ checksource environ.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 environ.c -o environ -lm
environ.c: In function â€˜mainâ€™:
environ.c:7:7: warning: â€˜returnâ€™ with no value, in function returning non-void [enabled by default]
       return;
       ^
environ.c:9:26: error: â€˜agrcâ€™ undeclared (first use in this function)
     printf("%s", environ[agrc]);
                          ^
environ.c:9:26: note: each undeclared identifier is reported only once for each function it appears in
environ.c:3:27: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main(int argc, char **argv){
                           ^
+ set +x
============================================================
bash-14$ e[Kmk environ.c[C[C[C[C[C[C[C[C[C[3@emacs[C[C[C[C[C[C[C[C[C[C
[?1049h[?1049h[?12;25h[?1h=[H[2J[52d[?25l-=--:----F1  [1m*scratch*   [0m   All L1     (Fundamental)--------------------------------------
[A[H[?12l[?25h[?12;25h[H[2J[53d[K[?1l>[?12l[?25h[?1049l[39;49m[?1049h[?1049h[?12;25h[?1h=[53;1H[?25lLoading /usr/share/emacs/site-lisp/site-start.d/focus-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;74H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lphp-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;77H[?25ldone[H
[?12l[?25h[?12;25h[53;50H[?25lo-mode-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;76H[?25ldone[H
[?12l[?25h[?12;25h[53;49H[?25lrpm-spec-mode-init.el (source)...[H
[?12l[?25h[?12;25h[53;82H[?25ldone[H
[?12l[?25h[?12;25h[53;52H[?25ldev-init.el (source)...[K[H
[?12l[?25h[?12;25h[53;75H[?25ldone[H
[?12l[?25h[?12;25h[>0c[53d[?25lLoading /usr/share/emacs/site-lisp/site-start.d/rpmdev-init.el (source)...done[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                                     [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction)---------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[53d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                    [0m[39;49m[27m
[A
[38;5;170m#include[39;49m [38;5;138m<stdio.h>[39;49m[K
[K
[38;5;28mint[39;49m [38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;136margc[39;49m, [38;5;28mchar[39;49m **[38;5;136margv[39;49m){[K
  [38;5;129mextern[39;49m [38;5;28mchar[39;49m **[38;5;136menviron[39;49m;[K
  [38;5;129mfor[39;49m([38;5;28mint[39;49m [38;5;136mi[39;49m = 0; i < argc; i++){[K
    [38;5;129mif[39;49m(environ[argc] == [38;5;73mNULL[39;49m){[K
      [38;5;129mreturn[39;49m;[K
    }[K
    printf([38;5;138m"%s"[39;49m, environ[agrc]);[K
  }[K
  [38;5;129mreturn[39;49m 1;[K
}[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250menviron.c   [0m[39;49m[30m[48;5;250m   All L1    RCS-1.3  (C/l Abbrev)-------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[53d[K[52;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[52;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[C[52;34H[?25l[30m[48;5;250m6[39;49m[7;2H[?12l[?25h[?12;25h[C[C[C[C[C		[C[C[C[C[52;34H[?25l[30m[48;5;250m7[39;49m[8;13H[?12l[?25h[?12;25h[?25l ;[52;6H[30m[48;5;250m**[39;49m[8;14H[?12l[?25h[?12;25h[?25l0;[?12l[?25h[?12;25h[53;1H[?25lSaving file /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/environ.c...[8;15H[?12l[?25h[?12;25h[53;1H[?25lWrote /afs/cats.ucsc.edu/users/u/brlgomez/private/cmps012m/lab5/environ.c[K[8;15H[?12l[?25h[?12;25h[52;6H[?25l[30m[48;5;250m----F1  [39;49m[1m[30m[48;5;250menviron.c   [0m[39;49m[30m[48;5;250m   All L7    RCS:[39;49m[8;15H[?12l[?25h[?12;25h[53;1H[K[?1l>[?12l[?25h[?1049l[39;49m
[4]+  Stopped             